Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh340-v2.tmx
Source language: bo
Languages: en

source: ངས་དེའི་ཅི་བདོག་པ་ཐམས་ཅད་ཕྲོགས་ཏེ་སུ་མི་བཏང་ངོ་ཞེས་བྱས་སོ། །
en: ‘I shall confiscate all his possessions, and never return them!’ he shouted.

source: དེ་ནས་དེའི་ཚིག་དེ་རྒྱལ་པོའི་བུས་ཐོས་ནས་མདུན་ན་འདོན་གྱི་བུ་ལ་སྦྲན་ཏེ།
en: The prince heard his words and told the magistrate’s son,

source: ཁྱོད་སོང་ལ་ཕ་ལ་མཆོད་རྟེན་གྱི་དུས་སྟོན་ལ་སྐྱེན་པར་སོང་ཤིག །རྒྱལ་པོས་ཁྱོད་ཅི་བདོག་པ་ཐམས་ཅད་ཕྲོགས་ས་རེ་ཞེས་གྱིས་ཤིག་ཅེས་བྱས་སོ། །
en: ‘Hurry to the festival of the stūpa, and tell your father that the king may confiscate all your possessions!’

source: དེ་ནས་དེ་ཐོས་མ་ཐག་ཏུ་བྲམ་ཟེ་མདུན་ན་འདོན་བུ་དང་ལྷན་ཅིག་ཏུ་གཙུག་ལག་ཁང་དུ་སོང་ངོ་། །
en: “As soon as he heard this, the brahmin magistrate’s son fled to the monastery.

source: དེ་དེར་སོང་ནས་སྐྱེ་བོ་ཕལ་པོ་ཆེ་མཆོད་རྟེན་གྱི་མཆོད་པ་ལ་བརྩོན་ཞིང་འདུག་པ་མཐོང་ངོ་། །
en: There he saw a great crowd in earnest veneration of the stūpa.

source: དེ་ནས་མདུན་ན་འདོན་གྱི་བུས་དེ་མཐོང་ནས་མཆོད་རྟེན་དེ་ལ་དད་པ་རྙེད་དོ། །
en: After the magistrate’s son saw this, he found faith in the stūpa,

source: དད་པ་རྙེད་ནས་མཆོད་རྟེན་དེ་ལ་བཀུར་སྟི་ཆེན་པོ་བྱས་ནས་སྨོན་ལམ་བཏབ་པ།
en: made a large offering to it, and prayed,

source: ཀྱེ་མ་དགེ་བའི་རྩ་བ་འདིས་ན། བདག་གང་དང་གང་དུ་སྐྱེ་བར་འགྱུར་བ་དེ་དང་དེར་ཕྱུག་ཅིང་ནོར་མང་ལ་ལོངས་སྤྱོད་ཆེ་བའི་རིགས་སུ་སྐྱེ་བར་གྱུར་ཅིག །
en: ‘By this root of virtue, wherever I am born, may it be into a family of great means, prosperity, and wealth.

source: བསྟན་བཅོས་ཐམས་ཅད་རྟོགས་པར་གྱུར་ཅིག །
en: May I master all the scriptures.

source: གཞུང་གིས་རྩོད་པ་ཐམས་ཅད་ཚར་ཆོད་པར་གྱུར་ཅིག །
en: May I defeat the advocates of all the different philosophical schools.

source: དེ་ཁོ་ནའི་བསྟན་པ་ལ་རབ་ཏུ་བྱུང་སྟེ་ཉོན་མོངས་པ་ཐམས་ཅད་སྤངས་ནས་དགྲ་བཅོམ་པ་ཉིད་མངོན་སུམ་དུ་བྱེད་པར་གྱུར་ཅིག་ཅེས་ཁྱེའུ་དེས་དེ་སྐད་དུ་སྨོན་ལམ་བཏབ་ནས།
en: Going forth in his doctrine alone may I cast away all afflictive emotions, and manifest arhatship.’

source: ཁྱེའུ་དེ་སྐྱེ་བོ་མང་པོས་བརྫིས་ཏེ་ཤི་ནས་དེ་མཆོད་རྟེན་དེ་ལ་སེམས་དགའ་བཞིན་དུ་ཤི་འཕོས་ཏེ་དུས་ལས་འདས་ནས་ལྷར་སྐྱེས་སོ། །
en: “As it happened, the young man was trampled by the crowd, and died, but dying as he did—filled with joy at the thought of the stūpa—he transmigrated and took rebirth as a god.

source: ལྷའི་བུའམ་ལྷའི་བུ་མོ་སྐྱེས་མ་ཐག་པ་ལ་ནི་ཆོས་ཉིད་ཀྱིས་སེམས་རྣམ་པ་གསུམ་སྐྱེ་བར་འགྱུར་ཏེ།
en: “Now when young gods and goddesses are born they possess three different types of innate knowledge.

source: བདག་གང་ནས་ཤི་འཕོས་གང་དུ་སྐྱེས་ལས་གང་གིས་སྐྱེས་སྙམ་མོ། །
en: They know (1) whence they have died and transmigrated, (2) where they have been born, and (3) why they have taken birth there.

source: དེ་ནས་དེས་མི་ལས་ཤི་འཕོས་པ་དང་ལྷར་སྐྱེས་པ་དང་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་འོད་སྲུང་གི་མཆོད་རྟེན་ལ་སེམས་དགའ་བ་བསྐྱེད་པས་དེར་སྐྱེས་པར་མཐོང་ངོ་། །
en: He saw that when he died as a human being, filled with joy at the thought of the stūpa of the totally and completely awakened Buddha Kāśyapa, he transmigrated and took rebirth as a god.

source: དེ་ནས་དེ་མཐོང་མ་ཐག་ཏུ་ལྷའི་བུ་དེས་སྔོན་གྱི་དྲིན་ཡང་དག་པར་དྲན་ནས།
en: As soon as he recognized this, he immediately recalled the buddha’s previous kindness.

source: རྣ་ཆ་གདུབ་ཀོར་དག་ཅིང་འགུལ་བར་ཐོགས་པ། ལུས་དོ་ཤལ་དང་སེ་མོ་དོས་བརྒྱན་པ། ནོར་བུ་རིན་པོ་ཆེ་སྣ་ཚོགས་ཀྱིས་སྤྲས་པའི་ཅོད་པན་ཅན། ལུས་གུར་གུམ་དང་ཏ་མ་ལའི་ལོ་མ་དང་སྤྲྀ་ཀ་ལ་སོགས་པས་བྱུགས་པ་དེས།
en: He began to decorate himself with earrings, garlands, and strings of precious stones, put on a crown decorated with various types of precious jewels, perfumed his body with saffron, tamala, spṛka, and other herbs,

source: དེ་ཉིད་ཀྱི་མཚན་མོ་ལྷའི་མེ་ཏོག་ཨུད་པ་ལ་དང་པད་མ་དང་ཀུ་མུ་ད་དང་པད་མ་དཀར་པོ་དང་མན་དཱ་ར་བ་རྣམས་ཀྱིས་ཐུ་བ་བཀང་སྟེ། ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་འོད་སྲུང་གི་མཆོད་རྟེན་ག་ལ་བ་དེར་སོང་སྟེ་
en: and that very night he filled the front of his long shirt with divine blue lotus, lotus, white water lily, white lotus, and mandārava flowers, and traveled to the stūpa of the totally and completely awakened Buddha Kāśyapa.

source: ཕྱིན་ནས་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་འོད་སྲུང་གི་མཆོད་རྟེན་ལ་ལྷའི་མེ་ཏོག་ཨུད་པ་ལ་དང་པད་མ་དང་ཀུ་མུ་ད་དང་པད་མ་དཀར་པོ་རྣམས་ཀྱིས་གཏོར་ནསཨ་ག་རུའི་ཕྱེ་མ་དང་རྒྱ་སྤོས་ཀྱི་ཕྱེ་མ་དང་ལྷའི་མེ་ཏོག་མན་དཱ་ར་བ་རྣམས་ཀྱིས་གཏོར་ནས་སེམས་དགའ་བར་གྱུར་ཏེ་འདུག་གོ། །
en: When he arrived he scattered the divine blue lotus, lotus, white water lily, white lotus, and mandārava flowers over the stūpa of the totally and completely awakened Buddha Kāśyapa, and after he scattered the divine blue lotus, lotus, white water lily, white lotus, and mandārava flowers, he sat filled with joy at the thought of the stūpa.

source: དེ་དེ་ན་འདུག་པ་ན་དེའི་ཕས་བདག་གི་བུ་སྐྱེ་བོ་ཕལ་པོ་ཆེ་དེ་དག་གིས་ཇི་ལྟར་བརྫིས་ཏེ་ཤི་བའི་གཏམ་ཐོས་སོ། །
en: “While he was sitting there, his father heard the news that his son had been trampled by the crowd and died,

source: ཐོས་མ་ཐག་ཏུ་དེར་སོང་སྟེ།
en: and he hurried to the stūpa.

source: བུའི་རུས་བུ་པང་དུ་འཁྱུད་ནས་ངུ་ཞིང་སྡུག་བསྔལ་ལ་སྨྲེ་སྔགས་འདོན་པ་དང་ལྷའི་བུ་དེས་མཐོང་ནས་དེ་ལ་སྨྲས་པ།
en: The young god saw him there holding the child’s corpse on his lap, wailing in sorrow and lamenting, and said to him,

source: ཕ་ཅིག་བདག་ནི་མྱ་ངན་བྱར་མེད་པར་གྱུར་གྱིས་མྱ་ངན་མ་བྱེད་ཅིག་སྡུག་བསྔལ་ཞིང་མ་འདུག་ཅིག་སྨྲེ་སྔགས་མ་འདོན་ཅིག་
en: ‘Oh Father, you needn’t mourn for me. Don’t mourn for me. Don’t sit and suffer so.’

source: བྲམ་ཟེས་སྨྲས་པ། ཁྱོད་སུ་ཞིག །
en: “ ‘Who are you?’ the brahmin asked.

source: དེས་སྨྲས་པ། བདག་ནི་ཁྱོད་ཀྱི་བུ་དེ་ཡིན་ནོ། །
en: “ ‘I am your son,’ he replied.

source: དེས་སྨྲས་པ། ཁྱོད་གང་དུ་སྐྱེས།
en: “ ‘Where did you take rebirth?’ he asked.

source: དེས་སྨྲས་པ། ལྷར་སྐྱེས་སོ། །
en: “ ‘I took birth among the gods,’ he replied.

source: དེས་སྨྲས་པ། ཁྱོད་ཀྱིས་ལས་ཅི་ཞིག་བྱས།
en: “ ‘What action did you take to be born there?’ he asked.

source: དེས་སྨྲས་པ། མཆོད་རྟེན་འདི་ཉིད་ལ་བསྙེན་བཀུར་བྱས་ནས་སེམས་དགའ་བ་བསྐྱེད་དོ། །
en: “ ‘I venerated the stūpa, and was filled with joy at the thought of it.

source: ཁྱོད་ཀྱིས་ཀྱང་སྔོན་གྱི་ལྟ་བའི་རྣམ་པ་བོར་ལ་མཆོད་རྟེན་འདི་ལ་བསྙེན་བཀུར་བྱས་ཏེ་སེམས་དགའ་བར་གྱིས་ཤིག་དང་། དེ་ལྟར་བྱས་ན་ཁྱོད་ལེགས་པ་ཐམས་ཅད་ཀྱི་འབྱུང་གནས་སུ་འགྱུར་རོ་ཞེས་
en: If you give up your former attitude, venerate the stūpa, and become filled with joy at the thought of it, you too will become a source of goodness.’

source: སྨྲས་ནས་ལྷའི་བུ་དེ་དེ་ཉིད་དུ་མི་སྣང་བར་གྱུར་ཏོ། །
en: Having said this, the young god disappeared on the spot.

source: དེ་ནས་ཚིག་དེ་ཐོས་ནས་བྲམ་ཟེ་དེ་ཡང་བུའི་མྱ་ངན་མེད་པར་གྱུར་ཏེ། མཆོད་རྟེན་དེ་ལ་ཡང་ཤིན་ཏུ་དགའ་བར་གྱུར་ཏོ། །
en: “When he heard these words, the brahmin no longer mourned his son and felt great happiness toward the stūpa.

source: དེ་དགའ་བར་གྱུར་ནས་མཆོད་རྟེན་དེ་ལ་བཀུར་སྟི་ཆེན་པོ་བྱས་ནས་སྨོན་ལམ་བཏབ་པ།
en: In his happiness he made a large offering to the stūpa and prayed,

source: བུ་འདི་ཉིད་ལས་བརྟེན་ཏེ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་འོད་སྲུང་གིས་བྲམ་ཟེའི་ཁྱེའུ་བླ་མ་ལུང་བསྟན་པ་གང་ཡིན་པའི་སངས་རྒྱས་བཅོམ་ལྡན་འདས་དེ་བདག་གིས་མཉེས་པར་བྱེད་པར་གྱུར་ཅིག །མི་མཉེས་པར་བྱེད་པར་མ་གྱུར་ཅིག་ཅེས་བྱས་སོ། །
en: Entrusting myself to my son, may I please and not displease Uttara, the young brahmin prophesied by the totally and completely awakened Buddha Kāśyapa to be the next blessed buddha.’

source: དེའི་ཚེ་བྲམ་ཟེའི་མདུན་ན་འདོན་གྱི་བུར་གྱུར་པ་གང་ཡིན་པ་དེ་ནི་བྲམ་ཟེའི་ཁྱེའུ་འདི་ཁོ་ན་ཡིན་ནོ། །
en: The one who was the magistrate’s son then is none other than this young brahmin.

source: དེའི་ཚེ་ཕར་གྱུར་པ་གང་ཡིན་པ་དེ་ནི། བྲམ་ཟེ་འདི་ཁོ་ན་ཡིན་ཏེ།
en: The one who was his father then is none other than this brahmin.

source: ཁྱེའུ་དེས་མཆོད་རྟེན་དེ་ལ་བཀུར་སྟི་བྱས་ནས་སྨོན་ལམ་བཏབ་པའི་ལས་དེའི་རྣམ་པར་སྨིན་པས་གང་དང་གང་དུ་སྐྱེས་པ་དེ་དང་དེར་ཕྱུག་ཅིང་ནོར་མང་ལ་ལོངས་སྤྱོད་ཆེ་བའི་རིགས་སུ་སྐྱེས་ཏེ
en: The young brahmin’s act of venerating the stūpa and saying that prayer ripened such that wherever he was born, it was into a family of great means, prosperity, and wealth;

source: གཟུགས་བཟང་ཞིང་བལྟ་ན་སྡུག་ལ་མཛེས་པར་གྱུར་ནས་བསྟན་བཅོས་ཐམས་ཅད་རྟོགས་ཏེ། གཞུང་གིས་རྒོལ་བ་ཐམས་ཅད་ཚར་བཅད་ནས་
en: such that he was well proportioned, pleasing to the eye, and beautiful; and such that he mastered all the scriptures and defeated the advocates of all the different philosophical schools.

source: དགེ་སློང་དག་ང་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་འོད་སྲུང་དང་། ཤིན་ཏུ་མཉམ་པ་དང་། ཤུགས་མཉམ་པ་དང་། མཛད་པ་མཉམ་པ་དང་། ཐབས་མཉམ་པ་བརྙེས་པར་གྱུར་ནས
en: “So it is, monks, now that I myself have become the very equal of the totally and completely awakened Buddha Kāśyapa—equal in strength, equal in deeds, and equal in skillful means—

source: འདིས་ང་མཉེས་པར་བྱས་ཏེ་མི་མཉེས་པར་མ་བྱས་ལ་ང་ཉིད་ཀྱི་བསྟན་པ་ལ་རབ་ཏུ་བྱུང་ནས་ཉོན་མོངས་པ་ཐམས་ཅད་སྤངས་ཏེ་དགྲ་བཅོམ་པ་ཉིད་མངོན་སུམ་དུ་བྱས་སོ། །
en: that he has pleased me, not displeased me, gone forth in my very doctrine, cast away all afflictive emotions, and manifested arhatship.

source: དེའི་ཕས་མཆོད་རྟེན་དེ་ལ་བསྙེན་བཀུར་བྱས་ནས། སྨོན་ལམ་བཏབ་པའི་ལས་དེའི་རྣམ་པར་སྨིན་པས་ནི། གང་དང་གང་དུ་སྐྱེས་པ་དེ་དང་དེར་ཕྱུག་ཅིང་ནོར་མང་ལ་ལོངས་སྤྱོད་ཆེ་བའི་རིགས་སུ་སྐྱེས་ཏེ།
en: “His father’s act of venerating the stūpa and saying that prayer ripened such that wherever he was born, it was into a family of great means, prosperity, and wealth.

source: བུ་འདི་ཁོ་ནའི་རྐྱེན་གྱིས་འདིས་ང་མཉེས་པར་བྱས་ཏེ་མི་མཉེས་པར་མ་བྱས་སོ།། །།
en: His son was the sole condition that caused him to please me, and not displease me.”

source: ཝ་ཞེས་བྱ་བ་ནི།
en: The Story of Jackal

source: གླེང་གཞི་མཉན་དུ་ཡོད་པ་ན་བཞུགས་ཏེ། དེའི་ཚེ་མཉན་དུ་ཡོད་པ་ན་ཁྱིམ་བདག་ཕྱུག་ཅིང་ནོར་མང་ལ་ལོངས་སྤྱོད་ཆེ་བ། ཡོངས་སུ་འཛིན་པ་ཡངས་ཤིང་རྒྱ་ཆེ་བ། རྣམ་ཐོས་ཀྱི་བུའི་ནོར་དང་ལྡན་པ། རྣམ་ཐོས་ཀྱི་བུའི་ནོར་དང་འགྲན་པ་ཞིག་གནས་པ་དེས།
en: When the Blessed One was in Śrāvastī, there was a certain householder, prosperous and wealthy, a person of vast and magnificent means, endowed with the wealth of Vaiśravaṇa—with wealth to rival Vaiśravaṇa’s.

source: ཐབས་ཟླར་བབ་པ་ལས་ཆུང་མ་བླངས་ནས་དེ་དེ་དང་ལྷན་ཅིག་ཏུ་རྩེ་ཞིང་དགའ་ལ་དགའ་མགུར་སྤྱོད་པ་ལས་ཕྱི་ཞིག་ན།
en: When the time came for him to marry he took a wife, and they enjoyed themselves and coupled.

source: དེའི་ཆུང་མ་ལ་བུ་ཆགས་ནས་དེའི་ལུས་ཐོག་ཐག་ནས་ཕྱི་སའི་དྲི་མནམ་པར་གྱུར་ལ་ཡིད་ལ་འདོད་པ་འདི་ལྟ་བུ་ཡང་བྱུང་སྟེ།
en: As they enjoyed themselves and coupled, one day his wife conceived, whereupon her whole body began to smell of excrement.

source: ཕྱི་ས་དང་གཅིན་བཟའ་ཞིང་འཐུང་ངོ་སྙམ་མོ། །དེ་ནས་དེས་ཁྱིམ་ཐབ་ལ་སྨྲས་པ།
en: Then she had the impulse to eat excrement and drink urine, and she told her husband,

source: ཇོ་བོ་བདག་གི་ཡིད་ལ་འདོད་པ་དེ་ལྟ་བུ་བྱུང་ངོ་ཞེས་བྱས་སོ། །
en: “Lord, I’m having certain impulses.”

source: དེ་ནས་དེ་ཐོས་མ་ཐག་ཏུ་ཁྱིམ་བདག་དེ་སྡུག་བསྔལ་ཆེན་པོ་སྐྱེས་ཏེ།
en: When he heard this, the householder was devastated, and he thought,

source: བདག་གི་ཆུང་མ་འདི་ལུས་སྲུལ་པོ་འགའ་ཞིག་གིས་ཐེབས་པར་མ་གྱུར་གྲང་སྙམ་ནས།
en: “Has my wife been possessed by one of those rotting spirits?”

source: དེས་མཚན་མཁན་རྣམས་ལ་བསྟན་ཏེ། མཚན་མཁན་རྣམས་ཀྱིས་སྨྲས་པ།
en: He took her to the soothsayers, and the soothsayers assured him,

source: ཁྱོད་ཀྱི་ཆུང་མ་འདི་ལུས་སྲུལ་པོས་ཐེབས་པ་ནི་མ་ཡིན་གྱི།
en: “Your wife has not been possessed by a rotting spirit.

source: ལྟོ་ན་འདུག་པའི་སེམས་ཅན་དེའི་དབང་གིས་གྱུར་པ་ཡིན་ཏེ།
en: All this has taken place on account of the being in her womb.

source: གང་གི་ཚེ་དེ་བཙས་པ་དེའི་ཚེ་ནི་བུད་མེད་འདིའི་ལུས་ལ་ཕྱི་སའི་དྲི་དང་ཡིད་ལ་འདོད་པ་འདི་འདྲ་བ་དེ་མེད་པར་འགྱུར་རོ་ཞེས་ཟེར་རོ། །
en: When the child is born, the smell of excrement will disappear from her body and such impulses will disappear from her mind.”

source: དེ་ནས་དེ་ཐོས་མ་ཐག་ཏུ་ཁྱིམ་བདག་དེས་ཆུང་མའི་ལུས་སྤོས་སྣ་ཚོགས་ཀྱིས་བྱུགས་ཏེ།
en: As soon as he heard this, the man began applying all manner of ointments to his wife’s body.

source: དེ་ཕྱི་ས་དང་གཅིན་ཟ་ཞིང་འཐུང་དུ་དོགས་ནས། བུད་མེད་དེའི་རིམ་གྲོ་བ་དང་སྲུངས་མ་རྣམས་བསྐོས་སོ། །
en: He was also worried that she would eat excrement and drink urine, so he appointed attendants and guards for his wife.

source: དེ་ནས་དེ་ཟླ་བ་དགུའམ་བཅུ་ལོན་པ་དང་ཁྱེའུ་ཕྱི་ས་དང་གཅིན་གྱིས་ཡོག་པ་ཞིག་བཙས་ནས།
en: After nine or ten months had passed, she gave birth to a child caked in excrement and urine.

source: དེ་ནས་ཁྱེའུ་དེ་བུད་མེད་རྣམས་ཀྱིས་བཀྲུས་ཏེ་མལ་དུ་བཞག་ཀྱང་། དེའི་ལུས་ལས་ཕྱི་སའི་དྲི་དེ་མེད་པར་མ་གྱུར་ཏེ། མས་ཁྱེའུ་དེ་སྤོས་སྣ་ཚོགས་ཀྱིས་བསྐུས་ཏེ་བཞག་གོ། །
en: The women washed the child and laid him out on the bed, but still the smell of excrement did not clear from his body, so his mother began applying all manner of ointments to him and left him like that.

source: དེ་ནས་བཙས་མ་ཐག་ཏུ་མའི་ཡིད་ལ་འདོད་པ་སྔ་མ་དེ་མེད་པར་གྱུར་ཏོ། །
en: After his birth the mother’s previous impulses disappeared.

source: དེ་ནས་དེའི་བཙས་སྟོན་རྒྱས་པར་བྱས་ནས་རིགས་དང་འཐུན་པའི་མིང་བཏགས་ཏེ།
en: At the elaborate feast celebrating his birth they named him according to their clan.

source: དེ་གང་གི་ཚེ་འགྲོ་ནུས་པར་གྱུར་པ་དེའི་ཚེ་བདག་གི་ཕྱི་ས་བླངས་ནས། ཁ་ཅིག་ནི་ཟ་བར་བྱེད་ཁ་ཅིག་ནི་ལུས་ལ་སྐུད་པར་བྱེད་དེ་བུད་མེད་དེ་དག་གིས་བཀག་གོ། །
en: but once he was able to walk, he would pick up excrement—some to eat, some to smear on his body—until the women put a stop to this.

source: དེ་ནས་དེ་གང་གི་ཚེ་ཆེར་སྐྱེས་པ་དེའི་ཚེ་ཡི་གེ་སློབ་ཏུ་བཅུག་སྟེ།
en: As he grew up they made him study letters,

source: དེ་མཁན་པོའི་ཐད་དུ་བཏང་བ་ལས། ཕྱི་སའི་འདམ་སྙག་སྙིག་ག་ལ་ཡོད་པར་སོང་ནས། ཕྱི་ས་ཟ་བར་བྱེད་དེ།
en: but when they sent him to a teacher, wherever there was some filthy excrement, he would go and eat it.

source: དེ་ཕ་མ་གཉིས་ཀྱིས་ཚོར་ནས་དེས་སྡུག་བསྔལ་ཆེན་པོར་གྱུར་ཏེ།
en: When his parents heard about this, they were devastated.

source: བདག་ཅག་གཉིས་ཀྱི་བུ་བྱུང་མོད་ཀྱི་འོན་ཀྱང་སྐྱོན་འདི་ལྟ་བུས་མ་རུང་བར་གྱུར་ན། འཇིག་རྟེན་གྱིས་ཤིན་ཏུ་དམད་པ་འདི་ལྟ་བུ་བདག་ཅག་ལ་ཅི་དགོས་སྙམ་དུ་བསམས་ནས།
en: “Oh sure, we had a son,” they thought, “but if he has problems like this—spoken ill of, all over the world—what use is he to us?”

source: དེ་ཁྱིམ་ནས་བསྐྲད་དེ་བཏང་ངོ་། །
en: and they threw him out of the house.

source: དེ་ནས་དེ་མི་གཙང་བའི་འདམ་སྙག་སྙིག་དེ་དག་ཉིད་དུ་གནས་བཅས་ཏེ། ཕྱི་ས་དང་གཅིན་ཟ་ཞིང་འཐུང་བར་བྱེད་དོ། །
en: And so he went to live in filthy excrement, and constantly ate excrement and drank urine.

source: དེ་ནས་དེ་མི་གཙང་བ་ཟ་བ་སྐྱེ་བོ་མང་པོས་མཐོང་ངོ་། །མཐོང་ནས་ཀྱང་དེ་དག་གཅིག་ལ་གཅིག་སྨྲས་པ།
en: Many people saw him eating filth, and when they saw this, they remarked to one another,

source: ཁྱེའུ་འདི་ནི་ཝ་བཞིན་དུ་ཕྱི་ས་དང་གཅིན་ཟ་ཞིང་འཐུང་ངོ་ཞེས་ཟེར་ནས།
en: “This young man is like a jackal , eating excrement and drinking urine.”

source: དེའི་མིང་སྔ་མ་མེད་པར་གྱུར་ཏེ། དེ་ཝ་བཞིན་དུ་ཕྱི་ས་དང་གཅིན་ཟ་ཞིང་འཐུང་བའི་ཕྱིར་མིང་ཝ་ཉིད་དུ་བཏགས་སོ། །
en: So instead of his old name they started calling him Jackal, since he ate excrement and drank urine like a jackal.

source: དེ་ནས་ཕྱི་ཞིག་ན་དེ་འོད་སྲུང་རྫོགས་བྱེད་ཀྱིས་མཐོང་ནས་དེས་བསམས་པ།
en: One day Pūraṇa Kāśyapa saw him, and thought,

source: བདག་ཅག་ནི་བ་ལང་གི་ལྕི་བ་ཟ་བའི་ཡི་དམ་བྱེད་པར་ཟད་ན། ཁྱེའུ་འདི་ནི་བདག་ཅག་པས་ཆེས་དཀའ་བ་བྱེད་པ་ཡིན་ཏེ།
en: “We ascetics merely vow to eat only cow dung, and yet here is this child practicing even greater austerities than ours!

source: གལ་ཏེ་འདི་བདག་གི་ཐད་དུ་རབ་ཏུ་བྱུང་ན་ནི་འདིར་འདི་ལ་བསོད་ནམས་མང་པོ་འཕེལ་བར་འགྱུར་རོ་སྙམ་དུ་བསམས་ནས།
en: If he went forth with us, his merit would multiply greatly.”

source: ཁྱེའུ་དེ་ལ་སྨྲས་པ། ཅི་ཁྱེའུ་ཁྱོད་ཀྱིས་འདི་ཡི་དམ་དུ་བཅས་པ་ཡིན་ནམ་འོན་ཏེ་གོམས་པའི་ཚུལ་ཅན་དུ་ཟད་དམ།
en: So he asked the young man, “Child, did you take a vow to do this, or is it merely your custom to do so?”

source: ཁྱེའུས་སྨྲས་པ། བདག་ནི་ཡི་དམ་དུ་བཅས་པ་ཇི་ལྟ་བུ་ཡིན་པ་ཡང་མི་ཤེས་ཏེ
en: “I don’t know that I’ve taken a vow, really,” the young man replied.

source: བདག་ནི་ཕྱི་ས་ཟ་བ་ལ་ཤིན་ཏུ་སྲེད་ཀྱི་ཟས་སྐོམ་དག་ལ་ནི་མི་སྲེད་དོ། །
en: “I just crave excrement. I don’t care for ordinary food and drink.”

source: འོད་སྲུང་རྫོགས་བྱེད་ཀྱིས་སྨྲས་པ། ཁྱེའུ་ངའི་ཐད་དུ་རབ་ཏུ་བྱུང་ལ་ཡི་དམ་དུ་ལོང་ཤིག་དང་གཞི་དེ་ལས་ཁྱོད་ཀྱི་བསོད་ནམས་མང་དུ་འཕེལ་བར་འགྱུར་རོ། །
en: “Child, become a renunciant like us,” urged Pūraṇa Kāśyapa . “Go forth with us and take a vow to do this. That will cause your merit to multiply greatly.”

source: ཁྱེའུས་སྨྲས་པ། ཁྱོད་ཇི་ལྟར་དགྱེས་པ་བཞིན་དུ་བགྱིའོ་ཞེས་སྨྲས་ནས།
en: “Sure, I’ll do whatever you like,” the young man said.

source: ཁྱེའུ་དེ་དེའི་ཕྱི་བཞིན་དུ་འབྲངས་ཏེ་སོང་ངོ་། །དེ་ནས་དེས་གནས་ཁང་དུ་ཁྲིད་ནས་
en: With those words the young man followed him to his dwelling place,

source: སྐྲ་བཏོགས་ཏེ། ཕོར་པ་དང་རྨ་བྱའི་མདོངས་ཀྱི་ཕྱགས་མ་བྱིན་ནས། ཕྱི་ས་ཟ་བའི་ཡི་དམ་བྱིན་ཏེ་བཏང་ངོ་། །
en: and after they had plucked out all his hair, they gave him a cup and a broom of peacock feathers, and he made a vow to eat excrement.

source: དེ་ནས་དེ་ཕྱི་སའི་འདམ་ག་ལ་བ་དེར་སོང་སྟེ་འདུག་གོ། །
en: Then he went to where there was some excrement, and there he stayed.

source: དེའི་ཚེ་མཉན་དུ་ཡོད་པ་ན་ཡི་དགས་ལྔ་བརྒྱ་ཙམ་འཁོད་པ་རྣམས་མཚན་མོ་གང་གི་ཚེ།
en: Now at that time some five hundred anguished spirits had settled down in Śrāvastī.

source: སྐྱེ་བོ་མང་པོ་ཉལ་བ་དེའི་ཚེ་ཕྱི་སའི་འདམ་གཞན་ནས་གཞན་དག་ཏུ་དོང་ནསཕྱི་ས་དང་གཅིན་ཟ་ཞིང་འཐུང་བར་བྱེད་དོ། །
en: At night when all the people were sleeping, they would go from one pile of excrement to another, eating the excrement and drinking the urine.

source: ཁྱེའུ་དེས་ཀྱང་ཡི་དགས་དེ་རྣམས་ཀྱི་སྒྲ་ནི་ཐོས་ལ་གཟུགས་མི་མཐོང་ངོ་། །
en: The young man could hear the sounds the anguished spirits made, but he could not see their forms.

source: དེ་ནས་ཕྱི་ཞིག་ན་འོད་སྲུང་རྫོགས་བྱེད་ཀྱིས་དེ་ལ་བརྟགས་ཏེ།
en: One day Pūraṇa Kāśyapa checked up on him and asked,

source: བུ་ཁྱོད་ཀྱིས་བརྟུལ་ཞུགས་ཡི་དམ་དུ་བླངས་པ་འདིས་ཁྱད་པར་ཅུང་ཟད་ལྟ་ཐོབ་བམ།
en: “Child, you took vows of yogic discipline. Have they brought you any special attainments?”

source: དེས་སྨྲས་པ། ཁྱད་པར་ཞེས་བྱ་བ་ཇི་ལྟ་བུ་ཡིན།
en: “What do you mean by ‘special’?” the young man asked in return.

source: རྫོགས་བྱེད་ཀྱིས་སྨྲས་པ། ཁྱོད་ཀྱིས་ལྷའི་གཟུགས་ལྟ་བུ་ལྟ་མཐོང་ངམ། ལྷའི་སྒྲ་སྐད་ལྟ་ཐོས་སམ།
en: Pūraṇa asked him, “Have you seen something like a divine form, or have you heard the sounds of gods?”

source: དེས་སྨྲས་པ། བདག་གིས་ལྷའི་གཟུགས་ལྟ་བུ་ནི་མ་མཐོང་གི་སྐྱེ་བོ་མང་པོའི་སྒྲ་སྐད་དག་ཐོས་ན
en: “I have not seen anything like a divine form,” he said, “though I did hear the sounds of many people.

source: འོན་ཀྱང་མངོན་སུམ་དུ་དེ་མ་མཐོང་ངོ་། །
en: But I couldn’t see them, exactly.”

source: རྫོགས་བྱེད་ཀྱིས་སྨྲས་པ། དེ་དག་ནི་བདག་ཉིད་ཆེན་པོ་བརྟུལ་ཞུགས་གྲུབ་པ་ཡིན་ནོ། །
en: “Those are the great souls whose yogic disciplines have been successful!”

source: ད་ཡང་ཡི་དམ་བཅས་པ་འདི་ཉིད་ཡི་དམ་དུ་བགྱིས་ཏེ་འདུག་ཤིག་དང་ཅི་སྟེ་ན་དེ་དག་གིས་ལུས་སྟོན་ཀྱང་སྲིད་དོ་ཞེས་བྱས་སོ། །
en: Pūraṇa exclaimed. “Renew your vow and stay on here. For if you do, it’s possible they will also show their bodies.”

source: དེ་ནས་ཕྱི་ཞིག་ན་ཡི་དགས་དེ་རྣམས་ཀྱིས་བསམས་པ།
en: One day the anguished spirits thought,

source: ཇི་ལྟར་བདག་ཅག་མི་དགེ་བའི་ལས་ཀྱིས་འདིར་སྐྱེས་ཏེ། སྡུག་བསྔལ་འདི་ལྟ་བུ་ཉམས་སུ་མྱོང་བ་དེ་བཞིན་དུ། ཁྱེའུ་འདི་ཡང་སྔོན་གྱི་མི་དགེ་བའི་ལས་ཀྱིས་སྡུག་བསྔལ་འདི་ལྟ་བུ་མྱོང་བ་ཡིན་ན།
en: “Just as we have committed misdeeds and taken birth here and now undergo such sufferings as these, so too this young man is undergoing these sufferings as a result of his previous misdeeds.”

source: ཅིའི་ཕྱིར་བདག་ཅག་གིས་འདི་ལ་ལུས་བསྟན་པར་ཅིས་མི་བྱ་ཞེས་ཟེར་ནས།
en: And then they said, “What reason do we have then for not showing our bodies to him?”

source: ཡི་དགས་དེ་རྣམས་ཀྱིས་ཁྱེའུ་དེ་ལ་ལུས་བསྟན་ཏེ། དེ་ཡི་དགས་དེ་རྣམས་དང་ལྷན་ཅིག་ཏུ་འགྲོགས་སོ། །
en: So the anguished spirits showed their bodies to the young man, and he cavorted with them.

source: དེ་ནས་ཕྱི་ཞིག་ན་འོད་སྲུང་རྫོགས་བྱེད་ཀྱིས་ཡང་དེ་ལ་བརྟགས་ཏེ།
en: Soon after, Pūraṇa Kāśyapa checked up on him again and asked,

source: བུ་ཁྱོད་ལ་བརྟུལ་ཞུགས་གྲུབ་པ་དེ་དག་གིས་ལུས་ཅུང་ཟད་ཙམ་བསྟན་ཏམ།
en: “Child, have those whose yogic disciplines were successful shown their bodies to you at all?”

source: དེས་སྨྲས་པ་ལུས་ནི་བསྟན་མོད་ཀྱི་མི་སྡུག་པའི་ཚུལ་དུ་བསྟན་ཏོ། །
en: “They did show me their bodies,” he said, “but in a very ugly way.”

source: འོད་སྲུང་རྫོགས་བྱེད་ཀྱིས་སྨྲས་པ། ད་དུང་ཡི་དམ་དུ་བཅས་པ་དེ་ཉིད་ཡི་དམ་དུ་གྱིས་ཏེ་འདུག་ཤིག་དང་། རང་བཞིན་གྱིས་གཟུགས་སྟོན་པར་འགྱུར་ཡང་སྲིད་དོ། །
en: “Renew your vow yet again and stay on here,” Pūraṇa Kāśyapa suggested. “It’s possible they will show you their true forms.”

source: དེ་ནས་ཕྱི་ཞིག་ན། ཚེ་དང་ལྡན་པ་ཤཱ་རིའི་བུས་བསམས་པ།
en: Around that time Venerable Śāriputra thought,

source: ཡི་དགས་འདི་རྣམས་ལས་ཟད་དེ་རིང་པོ་མི་ཐོགས་པར་འཆི་བར་འགྱུར་གྱིས།
en: “These anguished spirits have exhausted their previous deeds. They will die without delay.

source: བདག་གིས་འདི་རྣམས་གདུལ་བར་བྱའོ་སྙམ་སྟེ
en: Thus I will tame them.”

source: ཚེ་དང་ལྡན་པ་ཤཱ་རིའི་བུ་ཡི་དགས་ལྔ་བརྒྱ་པོ་རྣམས་ཀྱི་ཐད་དུ་སོང་ནས་སྨྲས་པ།
en: Venerable Śāriputra went to see the five hundred anguished spirits and said,

source: བཞིན་བཟངས་དག་འདི་ལྟར་འདུ་བྱེད་ཐམས་ཅད་ནི་མི་རྟག་གོ། །
en: “So it is, my friends: All conditioned things are impermanent.

source: ང་ལ་སེམས་དགའ་བར་གྱིས་ཤིག་དང་།
en: Let your minds be filled with joy at the thought of me,

source: ཡི་དགས་ཀྱི་སྐྱེ་གནས་དང་བྲལ་བར་འགྱུར་ཡང་སྲིད་དོ་ཞེས་བྱས་ནས་ཚེ་དང་ལྡན་པ་ཤཱ་རིའི་བུ་སོང་ངོ་། །
en: and you may even be freed from taking birth as anguished spirits.” With that, he departed.

source: ཡི་དགས་དེ་རྣམས་ཀྱང་ཚེ་ཟད་ནས་དེ་དག་ཚེ་དང་ལྡན་པ་ཤཱ་རིའི་བུ་ལ་སེམས་དགའ་བར་གྱུར་བཞིན་དུ་ཤི་ནས་ལྷའི་ཡུལ་དུ་སྐྱེས་སོ། །
en: The anguished spirits died, filled with joy at the thought of Venerable Śāriputra, and after they died, they took rebirth in the realm of the gods.

source: དེ་ནས་ཡི་དགས་ལས་ཤི་འཕོས་པ་དང་ལྷར་སྐྱེས་པ་དང་ཚེ་དང་ལྡན་པ་ཤཱ་རིའི་བུ་ལ་སེམས་དགའ་བར་གྱུར་པ་དེ་དག་གིས་མཐོང་ངོ་། །
en: They saw that when they had died as anguished spirits, filled with joy at the thought of Śāriputra, they transmigrated and took rebirth as gods.

source: དེ་ནས་སྔོན་ཡི་དགས་སུ་གྱུར་པའི་ལྷའི་བུ་དེ་དག་འདི་སྙམ་དུ་སེམས་ཏེ།
en: The young gods who formerly were anguished spirits thought,

source: བདག་ཅག་ཞག་ལོན་ནས་གཟོད་བཅོམ་ལྡན་འདས་ལ་བལྟ་བའི་ཕྱིར་འགྲོ་བ་ནི་བདག་ཅག་གི་ཆ་མ་ཡིན་གྱིས། བདག་ཅག་ཞག་མ་ལོན་པར་བཅོམ་ལྡན་འདས་ལ་བལྟ་བའི་ཕྱིར་འགྲོའོ་སྙམ་མོ། །
en: “It’s been a whole day since we went to see the Blessed One. This isn’t proper of us. Not a day should pass without our seeing the Blessed One.”

source: དེ་ནས་སྔོན་ཡི་དགས་སུ་གྱུར་པའི་ལྷའི་བུ། རྣ་ཆ་གདུབ་ཀོར་དག་ཅིང་འགུལ་བ་ཐོགས་པ། ལུས་དོ་ཤལ་དང་སེ་མོ་དོས་བརྒྱན་པ། ནོར་བུ་རིན་པོ་ཆེ་སྣ་ཚོགས་ཀྱིས་སྤྲས་པའི་ཅོད་པན་ཅན་ལུས་གུར་གུམ་དང་ཏ་མ་ལའི་ལོ་མ་དང་སྦྲྀ་ཀ་ལ་སོགས་པས་བྱུགས་པ་དེ་དག་གིས་
en: Then the young gods who formerly were anguished spirits decorated themselves with earrings, garlands, and strings of precious stones, put on crowns decorated with various types of precious jewels, and perfumed their bodies with saffron, tamala, spṛka, and other herbs.

source: དེ་ཉིད་ཀྱི་མཚན་མོ་ལྷའི་མེ་ཏོག་ཨུད་པ་ལ་དང་། པད་མ་དང་། ཀུ་མུ་དཱ་དང་། པད་མ་དཀར་པོ་དང་། མན་དཱ་ར་རྣམས་ཀྱིས་ཐུ་བ་བཀང་སྟེ
en: That night they filled the front of their long shirts with divine blue lotus, lotus, white water lily, white lotus, and mandārava flowers.

source: བཅོམ་ལྡན་འདས་ཀྱི་ཐད་དུ་ལྷགས་ནས་བཅོམ་ལྡན་འདས་ལ་ལྷའི་མེ་ཏོག་གིས་གཏོར་ཏོ། །
en: They approached the Blessed One and scattered the divine flowers over him.

source: དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་དེ་དག་ལ་ཆོས་བསྟན་ཏེ། དེ་དག་ཐམས་ཅད་ཀྱིས་བདེན་པ་རྣམས་མཐོང་ངོ་། །
en: Then the Blessed One taught them the Dharma, and all of them saw the truths.

source: དེ་དག་གིས་བདེན་པ་མཐོང་ནས་བཅོམ་ལྡན་འདས་ཀྱི་ཐད་ནས་སོང་སྟེ།
en: After seeing the truths, they took leave of the Blessed One.

source: རང་གི་གནས་སུ་དོང་བ་ན་དེ་དག་གིས་ཁྱེའུ་ཝ་ཡིད་ལ་དྲན་ནས་དེ་དག་གིས་བསམས་པ།
en: On their way back whence they came, they recalled young Jackal and thought,

source: བདག་ཅག་ནི་འཕགས་པ་ཤཱ་རིའི་བུ་ལས་བརྟེན་ཏེ། ཡི་དགས་ཀྱི་སྐྱེ་གནས་དང་བྲལ་ནས། ལྷར་སྐྱེས་ཀྱིས་བདག་ཅག་དོང་སྟེ་ཝའི་དོན་བྱའོ། །
en: “By entrusting ourselves to Noble Śāriputra, we were freed from rebirth as anguished spirits, and took rebirth as gods. Let us go now and act for the benefit of Jackal.

source: འོན་ཀྱང་དེ་ཡང་བཅོམ་ལྡན་འདས་ཀྱི་ཐད་དུ་སོང་ནས་བཅོམ་ལྡན་འདས་ལས་བརྟེན་ཏེ། སྡུག་བསྔལ་དེ་ལས་ཐར་བར་འགྱུར་ཡང་སྲིད་དོ་
en: Then he too will go to see the Blessed One, and by entrusting himself to the Blessed One, perhaps he too will be freed from suffering.”
